---
kind: property
id: P:Autodesk.Revit.DB.Analysis.EnergyAnalysisConstruction.IsSchematic
source: html/4ce9f618-21a5-a8f7-0f91-68b2298e92bb.htm
---
# Autodesk.Revit.DB.Analysis.EnergyAnalysisConstruction.IsSchematic Property

Indicates if this originates from a schematic or analytical construction.

## Syntax (C#)
```csharp
public bool IsSchematic { get; }
```